socialNetwork/runs/e2e-read-home-timelines-1-j9UE/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 18.465ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 18.759ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 17.073ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 17.033ms, rate sampling interval: 54ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.51ms    7.60ms  43.39ms   83.19%
    Req/Sec   252.14     65.78   413.00     68.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.19ms
 75.000%   19.79ms
 90.000%   26.24ms
 99.000%   43.39ms
 99.900%   64.70ms
 99.990%   83.33ms
 99.999%   87.81ms
100.000%   87.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.897     0.000000            1         1.00
       9.695     0.100000         2009         1.11
      10.655     0.200000         4017         1.25
      11.615     0.300000         6007         1.43
      12.751     0.400000         8013         1.67
      14.191     0.500000        10008         2.00
      15.087     0.550000        11010         2.22
      16.103     0.600000        12010         2.50
      17.247     0.650000        13020         2.86
      18.495     0.700000        14014         3.33
      19.791     0.750000        15018         4.00
      20.527     0.775000        15516         4.44
      21.343     0.800000        16014         5.00
      22.191     0.825000        16517         5.71
      23.231     0.850000        17017         6.67
      24.415     0.875000        17515         8.00
      25.279     0.887500        17768         8.89
      26.239     0.900000        18016        10.00
      27.327     0.912500        18266        11.43
      28.335     0.925000        18517        13.33
      29.615     0.937500        18765        16.00
      30.335     0.943750        18890        17.78
      31.231     0.950000        19017        20.00
      32.207     0.956250        19144        22.86
      33.407     0.962500        19265        26.67
      34.783     0.968750        19392        32.00
      35.615     0.971875        19453        35.56
      36.543     0.975000        19518        40.00
      37.375     0.978125        19578        45.71
      38.463     0.981250        19640        53.33
      39.903     0.984375        19704        64.00
      40.639     0.985938        19735        71.11
      41.471     0.987500        19766        80.00
      42.623     0.989062        19797        91.43
      43.871     0.990625        19828       106.67
      45.535     0.992188        19859       128.00
      46.559     0.992969        19875       142.22
      47.007     0.993750        19890       160.00
      48.479     0.994531        19908       182.86
      49.855     0.995313        19923       213.33
      51.007     0.996094        19937       256.00
      52.063     0.996484        19945       284.44
      53.343     0.996875        19953       320.00
      54.239     0.997266        19961       365.71
      56.095     0.997656        19969       426.67
      57.823     0.998047        19976       512.00
      59.231     0.998242        19980       568.89
      60.351     0.998437        19984       640.00
      61.247     0.998633        19989       731.43
      63.871     0.998828        19992       853.33
      65.471     0.999023        19996      1024.00
      65.663     0.999121        19998      1137.78
      66.175     0.999219        20000      1280.00
      67.391     0.999316        20003      1462.86
      67.583     0.999414        20004      1706.67
      69.375     0.999512        20006      2048.00
      69.567     0.999561        20007      2275.56
      73.279     0.999609        20008      2560.00
      73.791     0.999658        20009      2925.71
      75.327     0.999707        20010      3413.33
      78.463     0.999756        20011      4096.00
      78.463     0.999780        20011      4551.11
      82.495     0.999805        20012      5120.00
      82.495     0.999829        20012      5851.43
      83.327     0.999854        20013      6826.67
      83.327     0.999878        20013      8192.00
      83.327     0.999890        20013      9102.22
      87.679     0.999902        20014     10240.00
      87.679     0.999915        20014     11702.86
      87.679     0.999927        20014     13653.33
      87.679     0.999939        20014     16384.00
      87.679     0.999945        20014     18204.44
      87.807     0.999951        20015     20480.00
      87.807     1.000000        20015          inf
#[Mean    =       16.512, StdDeviation   =        7.601]
#[Max     =       87.744, Total count    =        20015]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29927 requests in 30.00s, 419.09MB read
Requests/sec:    997.57  
Transfer/sec:     13.97MB